# tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# formula
brew "bash"
brew "bash-completion@2"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "jq"
brew "mas"
brew "mysql-client"
brew "nano"
brew "nodenv"
brew "peco"
brew "starship"
brew "tree"

# cask
cask "deepl"
cask "discord"
cask "docker"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "jetbrains-toolbox"
cask "minecraft"
cask "notion"
cask "raycast"
cask "slack"
cask "steam"
cask "thunderbird"
cask "visual-studio-code"

# mas
mas "Focus To-Do", id: 1258530160
mas "LINE", id: 539883307
