# =====================================
# おまじない
# =====================================
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# =====================================
# CLI ツール
# =====================================
brew "bash"                              # Bash
brew "bash-completion@2"                 # Bash の補完スクリプト
brew "gh"                                # GitHub
brew "ghq"                               # リポジトリ管理用ツール
brew "git"                               # Git
brew "go"                                # Go
brew "jq"                                # JSON 表示、加工用ツール
brew "mysql-client"                      # MySQL クライアントツール
brew "nodenv"                            # Node.js のバージョン管理ツール
brew "peco"                              # シェルで自由に飛ぶためのツール
brew "starship"                          # プロンプト設定ツール
brew "tree"                              # ディレクトリ構成を表示するツール

# =====================================
# GUI ツール
# =====================================
cask "deepl"                             # 翻訳アプリ
cask "discord"                           # Discord
cask "docker"                            # Docker Desktop for Mac
cask "font-jetbrains-mono"               # エディタ/IDE 用のフォント
cask "font-jetbrains-mono-nerd-font"     # ターミナル用のフォント
cask "google-chrome"                     # Google Chrome
cask "google-cloud-sdk"                  # Google Cloud SDK
cask "google-drive"                      # Google Drive
cask "jetbrains-toolbox"                 # JetBrains 製品管理用ツール
cask "notion"                            # Notion
cask "postman"                           # Web API のテスト用ツール
cask "raycast"                           # 多機能ランチャーアプリ
cask "slack"                             # Slack
cask "thunderbird"                       # メールクライアント

# =====================================
# Mac App Store アプリケーション
# =====================================
mas "LINE", id: 539883307
