# tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# formula
brew "clang-format"
brew "cmake"
brew "fish"
brew "gcc"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "jq"
brew "less"
brew "llvm"
brew "mas"
brew "nano"
brew "ninja"
brew "peco"
brew "starship"
brew "tree"
brew "volta"
brew "zlib"

# cask
cask "deepl"
cask "docker"
cask "figma"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "google-drive"
cask "jetbrains-toolbox"
cask "notion"
cask "raycast"
cask "slack"
cask "thunderbird"
cask "visual-studio-code"

# mas
mas "Focus To-Do", id: 1258530160
mas "LINE", id: 539883307
