brew "aqua"
brew "awscli"
brew "direnv"
brew "fish"
brew "gh"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "grep"
brew "jq"
brew "less"
brew "nano"
brew "peco"
brew "starship"
brew "terminal-notifier"
brew "tokei"
brew "tree"

cask "bruno"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "drawio"
cask "figma"
cask "font-udev-gothic"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "logi-options+"
cask "notion"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"
cask "zoom"

vscode "bmalehorn.vscode-fish"
