tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "sqldef/sqldef"

brew "awscli"
brew "direnv"
brew "gh"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "go"
brew "grep"
brew "jq"
brew "less"
brew "mas"
brew "nano"
brew "nvm"
brew "peco"
brew "starship"
brew "terraform"
brew "tree"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "sqldef/sqldef/mysqldef"

cask "deepl"
cask "docker"
cask "drawio"
cask "figma"
cask "firefox"
cask "font-udev-gothic"
cask "gather"
cask "google-chrome"
cask "google-drive"
cask "jetbrains-toolbox"
cask "logi-options-plus"
cask "notion"
cask "raycast"
cask "ticktick"
cask "visual-studio-code"
cask "zoom"

mas "Trello", id: 1278508951

vscode "davidanson.vscode-markdownlint"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "negokaz.zenn-editor"
vscode "yzhang.markdown-all-in-one"
