tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "awscli"
brew "direnv"
brew "gh"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "go"
brew "grep"
brew "jq"
brew "less"
brew "nano"
brew "nvm"
brew "peco"
brew "starship"
brew "tree"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"

cask "chatgpt"
cask "deepl"
cask "docker"
cask "drawio"
cask "figma"
cask "font-udev-gothic"
cask "google-chrome"
cask "google-drive"
cask "jetbrains-toolbox"
cask "logi-options+"
cask "notion"
cask "raycast"
cask "zoom"
